Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: དགེ་བའི་རྩ་བ་འདིས་བདག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པ་དེའི་བསྟན་པ་ལ་བདག་རབ་ཏུ་བྱུང་ནས། ཇི་ལྟར་བདག་གི་མཁན་མོ་འདི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་གིས་མདོ་སྡེ་རྣམ་པར་འབྱེད་པར་བྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ། བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེས་མདོ་སྡེ་རྣམ་པར་འབྱེད་པར་བྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག་ཅེས་བྱས་ཏེ། དེའི་སྨོན་ལམ་གྱི་དབང་གིས་ངས་ད་ལྟར་མདོ་སྡེ་རྣམ་པར་འབྱེད་པར་བྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།
en: By this root of merit, may I go forth in the teachings of the Buddha Śākyamuni whom the young brahmin named Uttara was predicted to become by the Blessed One, the Perfectly Awakened One Kāśyapa: “Young brahmin, you will become a tathāgata, an arhat, a perfectly awakened one called Śākyamuni when people’s lifespans are a hundred years long.” As this preceptress of mine was praised as the best of those who analyze the sūtras, may I too be praised as the best of those who analyze the sūtras by the Blessed One Śākyamuni.’ Because of this wish, she was praised by me as the best of those who analyze the sūtras.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་གཅིག་ཏུ་གནག་པའི་ལས་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ་ཞེས་བྱ་བ་ནས་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུ་སྟེ།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative . . . you should seek . . . .

source: །དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ་ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Monks, that is how you must train.” Thus spoke the Blessed One. V. Vairambhya A. The Brahmin in a Park

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཡུལ་དགྲ་མཐའ་གང་ན་བར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to the country of Vairambhya.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གཤེགས་པ་དང་། ཇི་ཙམ་ན་ཀུན་དགའ་ར་བ་ཞིག་ན་བྲམ་ཟེ་ཞིག་ཁྲོན་པ་ནས་ཆུ་བཅུས་ཤིང་ཀུན་དགའ་ར་བ་བཅུ་བར་བརྩམས་སོ།
en: After that, the Blessed One departed. At that time, in a certain park a brahmin was beginning to sprinkle the park with water, having drawn water from a well.

source: །བྲམ་ཟེ་དེས་རྒྱང་རིང་པོ་ཁོ་ན་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བསམས་པ། གལ་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མ་ཀུན་དགའ་ར་བར་ཞུགས་ན་ཀུན་དགའ་ར་བ་དང་ཆུ་མ་རུང་བར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས་སྒོ་བཅད་དེ་དཔྱང་ཐག་དང་ཆུ་སྣོད་སྦས་ནས་འདུག་གོ།
en: When the brahmin saw the Blessed One from a distance, he thought, “If the śramaṇa Gautama enters the park, the park and the water will be polluted,” and he shut the gate, hid the rope and pitcher, and sat down.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་གྱིས་ཀུན་དགའ་ར་བར་ཞུགས་པ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལྔ་ལེན་གྱིས་ཁྲོན་པ་དེ་བཟུང་ནས་ཀུན་དགའ་ར་བ་དེ་ཐམས་ཅད་ཆུས་ཡོག་པར་བྱས་སོ།
en: Then the Blessed One entered the park using his magical power. Pāñcika, the great general of yakṣas, seized the well and submerged the entire park in water.

source: །དེ་ནས་བྲམ་ཟེ་དེ་དག་དགེ་སྦྱོང་གཽ་ཏ་མ་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཡིན་ནོ། །སྙམ་དུ་རིག་ནས་མངོན་པར་དད་པར་གྱུར་ཏེ་གསོལ་པ། ཤེས་ལྡན་གཽ་ཏ་མ་ཚུར་སྤྱོན།
en: Then the brahmin understood, “This śramaṇa Gautama is of great magical power and dignity.” Filled with faith, he said, “O honorable Gautama, come.

source: དཔྱང་ཐག་ནི་འདི་ལགས།
en: Here is a rope;

source: ཆབ་སྣོད་ནི་འདི་ལགས་ཀྱིས་ཆབ་ཅི་བདེར་བཞེས་སུ་གསོལ།
en: here is a pitcher. Please accept water in comfort.”

source: གལ་ཏེ་ཀུན་ན་ཆུ་ཡོད་ན། །ཁྲོན་པའི་ཆུས་ཀོ་ཅི་ཞིག་བྱ།
en: “If there is water everywhere, What need is there for a well?

source: །འདིར་ནི་སྲེད་པའི་རྩ་བཅད་ནས།
en: Having cut off the root of desire here,

source: །གང་ཞིག་ཡོངས་སུ་བརྩལ་བར་སྤྱོད།
en: Who would look for something more to do?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྲམ་ཟེ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན་ཞེས་བྱ་བ་ནས། དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་རབ་ཏུ་བྱུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Then the brahmin said to the Blessed One, “O Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya . . . .” The Blessed One ordained him by saying “Come, monk,” . . . .

source: །མདོ་ལ་དབང་པོ་རབ་ཞིར་གནས་གྱུར་ཏེ།
en: His faculties were at once calmed,

source: །དེས་བརྩོན་འགྲུས་དང་། འབད་པ་དང་། བརྩལ་བར་བྱས་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་དགྲ་བཅོམ་པར་གྱུར་ཏེ།
en: He, exerting himself, endeavoring, and striving, abandoned all the defilements, actualized the state of an arhat, and became an arhat.

source: ཁམས་གསུམ་གྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱ་བ་ནས་མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: He was free from desire for the three realms . . . became an object of . . . praise . . . . B. King Agnidatta’s Offer

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དཔའ་སྡེ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་ཡུལ་དགྲ་མཐར་གཤེགས་ཏེ། དགྲ་མཐའ་ན་སྦུ་བུ་ཅན་གྱི་ཤིང་ནིམ་པའི་དྲུང་ན་བཞུགས་སོ།
en: Afterward the Blessed One, traveling in Śūrasena, arrived at Vairambhya and stayed under the neem tree of Naḍera near Vairambhya.

source: །དེའི་ཚེ་དགྲ་མཐའ་ན་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ཞེས་བྱ་བ་འབྱོར་བ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་མི་མང་པོས་རབ་ཏུ་གང་བ་ན་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: At that time, a brahmin king named Agnidatta ruled over Vairambhya, which was rich, prosperous, peaceful, abundant in food, and full of many people.

source: །རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་དགེ་སྦྱོང་གཽ་ཏ་མ་དཔའ་སྡེ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་དགྲ་མཐར་བྱོན་ནས། དགྲ་མཐའ་ན་སྦུ་བུ་ཅན་གྱི་ཤིང་ནིམ་པའི་དྲུང་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་མཐའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་བྱས། བླ་མར་བྱས། རྗེད་པར་བྱས།
en: When Agnidatta, the brahmin king, heard that the śramaṇa Gautama, having traveled through Śūrasena, had arrived in Vairambhya and was staying under the neem tree of Naḍera near Vairambhya, he thought, “The śramaṇa Gautama is treated with honor, looked up to, esteemed, venerated, and paid homage to as a worthy man by all the neighboring kings.

source: མཆོད་པར་བྱས་ཏེ་དགྲ་བཅོམ་པར་བཀུར་ལ།
en: If I do not treat him with honor, the neighboring kings will reproach me:

source: གལ་ཏེ་བདག་གིས་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་བཀུར་སྟི་མ་བྱས་ན་མཐའི་རྒྱལ་ཕྲན་རྣམས་ཤེས་ལྡན་དག་ཀྱེ་མ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ནི་བྱིས་པ་ཡིན་ཏེ།
en: ‘Sirs, what a fool Agnidatta, the brahmin king, is!

source: དེའི་གྲོང་དང་ཞིང་ན་དགེ་སྦྱོང་གཽ་ཏ་མ་ཉེ་བར་རྟེན་ཅིང་བཞུགས་ན་བསྙེན་བཀུར་མ་བྱས་སོ་ཞེས་སྨོད་པར་འགྱུར་གྱིས། མ་ལ་བདག་གིས་དགེ་སྦྱོང་གཽ་ཏ་མ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་སོ་སྙམ་དུ་བསམས་ནས། རྒྱལ་པོ་ཆེན་པོའི་འབྱོར་པ་དང་། རྒྱལ་པོ་ཆེན་པོའི་མཐུས་དགྲ་མཐའ་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: While the śramaṇa Gautama has come and is staying in his town, his country, the king does not treat him with honor.’ Now I will offer the śramaṇa Gautama together with the community of disciples all the requisites.” Having thought this, he went to the Blessed One, displaying great royal treasures and great royal power.

source: བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When he arrived, he made plenty of pleasant and joyful conversation with the Blessed One, and then sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཞེས་བྱ་བ་ནས་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When Agnidatta, the brahmin king, had sat down to one side, the Blessed One, through talk consistent with the Dharma, . . . . When he had . . . delighted him . . . , the Blessed One remained silent.

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཤེས་ལྡན་གཽ་ཏ་མ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་དགུང་ཟླ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་འབུལ་ཞིང་མཆིས་ན་བདག་ལ་གནང་བར་མཛད་དུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: Then Agnidatta, the brahmin king, rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the honorable Gautama with the community of disciples assent to my offer of the requisites for three months: namely, robes, almsfood, bedding and seats, and medicines for the sick.” The Blessed One assented to Agnidatta, the brahmin king, by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ། རྗེས་སུ་ཡི་རངས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་།
en: Then Agnidatta, the brahmin king, knowing that the Blessed One had assented by remaining silent, rejoiced in and praised the words of the Blessed One, and he rose from his seat and departed.

source: །དེ་རང་གི་ཁྱིམ་དུ་སོང་ནས་བློན་པོ་རྣམས་ལ་བསྒོ་བ། ཉི་མ་རེ་རེ་ཞིང་ལྔ་བརྒྱའི་བཟའ་བ་དང་བཅའ་བ་སྣ་བཅྭ་བརྒྱད་དང་། སྲན་ཚོད་སྣ་ཚོགས་དང་། ཚོད་མ་རོ་དང་ལྡན་པ་དང་། འབྲས་ཆན་རབ་ཏུ་མང་པོར་ཚོས་ཤིག །དགྲ་མཐར་དྲིལ་སྒྲོགས་སུ་བཅུག་པ།
en: He went to his own residence and ordered his ministers, “Every day cook eighteen kinds of food, various kinds of bean paste, tasty sauce, and much rice for five hundred people.” Then he proclaimed with the ringing of bells:

source: དགེ་སྦྱོང་གཽ་ཏ་མ་ཟླ་བ་གསུམ་དུ་གཞན་གྱིས་གདུགས་ཚོད་མ་གསོལ་ཅིག །གང་ཞིག་གིས་གདུགས་ཚོད་གསོལ་ན་དེ་ནི་ཆད་པར་གསད་དོ་ཞེས་དེས་དེ་སྐད་དུ་དྲིལ་བསྒྲགས་ནས་ནུབ་མོ་ཉལ་བ་དང་རྨི་ལམ་ན་བདག་གི་རྒྱུ་མས་དགྲ་མཐའི་གྲོང་ཁྱེར་ཐམས་ཅད་བསྐོར་བ་རྨིས་སོ།
en: “None but I should offer meals to the śramaṇa Gautama for three months. Anyone who offers him a meal will be killed as punishment.” After issuing this proclamation with the ringing of bells, he dreamt while sleeping in the night that the entire city of Vairambhya was encircled with his own intestine. Having dreamt this, he sprang to his feet from his large bed, frightened and dejected, with the hairs in every pore of his body standing on end.

source: །རྨིས་ནས་ཀྱང་སྔངས་སྐྲག་བྲེད་ཅིང་སྤུ་ཟིང་ཞེས་བྱེད་ནས་མྱུར་བ་མྱུར་བར་མལ་ཆེན་པོ་ནས་ལངས་ཏེ། ལག་པ་ལ་འགྲམ་པ་གཏད་ནས་གཞི་འདི་ལས་བདག་རྒྱལ་སྲིད་ལས་ཉམས་པའམ། སྲོག་གི་བར་ཆད་དུ་མི་འགྱུར་གྲང་སྙམ་དུ་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་པ་ལས་དེ་ནམ་ནངས་ནས་བྲམ་ཟེ་མདུན་ན་འདོན་ལ་སྨྲས་པ།
en: He sat plunged into grief, resting his cheek on his hand, asking himself, “Oh, is there any chance I will lose my throne or be in danger of death because of this?” After the night had passed, he said to the brahmin who was the chief priest, “Sir, I have dreamt such-and-such.

source: མཁན་པོ་བདག་གིས་འདི་འདྲ་བའི་རྨི་ལམ་ཞིག་མཐོང་ན་དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: What should I do about this?”

source: བྲམ་ཟེ་མདུན་ན་འདོན་གྱིས་བསམས་པ།
en: The brahmin chief priest thought, “The king has had an auspicious dream.

source: འདི་ལྟར་ལྷས་རྨང་ལམ་བཟང་པོ་ཞིག་རྨིས་ཏེ་གལ་ཏེ་བདག་གིས་དེ་དང་མཐུན་པར་བསྙད་ན་འདི་ལྷག་པར་ཡང་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་དད་པ་སྐྱེད་པར་འགྱུར་གྱི་མ་ལ་བདག་གིས་འདི་ངན་པར་བསྙད་དོ་སྙམ་དུ་བསམས་ནས་སྨྲས་པ། ལྷ་རྨང་ལམ་མི་བཟང་ལགས་སོ།
en: Since, if I speak well of it, he will increase his faith in the śramaṇa Gautama all the more, I will now speak ill of it.” He said, “Your Majesty, this is an inauspicious dream.”

source: །མཁན་པོ་འདིའི་འབྲས་བུ་ཅིར་འགྱུར།
en: “Sir, what will be the result of this?”

source: ལྷ་གདོན་མ་འཚལ་བར་རྒྱལ་སྲིད་ལས་ཉམས་པའམ་སྲོག་གི་བར་ཆད་དུ་འགྱུར་ལགས་སོ། །རྒྱལ་པོས་བསམས་པ།
en: “Your Majesty, you will certainly lose your throne or be in danger of death.”

source: ཨེ་མའོ་ཀྱི་ཧུད་བདག་རྒྱལ་སྲིད་ལས་ཉམས་པའམ། སྲོག་གི་བར་ཆད་དུ་མི་འགྱུར་གྲང་སྙམ་དུ་བསམས་ནས་བྲམ་ཟེ་མདུན་ན་འདོན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་གིས་ན་ཁོ་བོ་རྒྱལ་སྲིད་ལས་ཉམས་པར་མི་འགྱུར་བ་དང་། སྲོག་གི་བར་ཆད་དུ་མི་འགྱུར་བའི་ཐབས་བཟང་པོ་ཅི་ཡོད།
en: “Ah,” thought the king, “I am losing my throne or am in danger of death!” With this thought, he asked the brahmin, the chief priest, “Is there any good way to avoid losing my throne and being in danger of death?”

source: དེས་སྨྲས་པ། ལྷ་གལ་ཏེ་མི་གདའ་བའི་ཕྱོགས་སུ་ཟླ་བ་གསུམ་བཞུགས་ན། དེས་ན་ལྷ་རྒྱལ་སྲིད་ལས་མི་ཉམས་ཤིང་སྲོག་གི་བར་ཆད་དུ་མི་འགྱུར་ལགས་སོ།
en: “If Your Majesty will stay in a concealed location for three months,” said the brahmin, “then Your Majesty will neither lose his throne nor be in danger of death.”

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་བསམས་པ། གལ་ཏེ་དེ་ལྟ་ན་དེ་བྱ་སླ་བས་དྲིལ་སྒྲོགས་སུ་གཞུག་གོ་སྙམ་ནས།
en: Agnidatta, the brahmin king, thought, “If so, that is easy to do.

source: དེས་ཡུལ་ཐམས་ཅད་དུ་དྲིལ་སྒྲོགས་སུ་བཅུག་པ།
en: I will make a proclamation with the ringing of bells.” He proclaimed throughout the country with the ringing of bells:

source: ང་ལ་ཟླ་བ་གསུམ་དུ་ལྟ་ཞིང་ཉེ་བར་སུ་ཡང་མ་འོང་ཤིག །གང་ཞིག་འོངས་ན་དེ་ནི་ཆད་པར་གསད་དོ་ཞེས་དྲིལ་སྒྲོགས་སུ་བཅུག་ནས་ཟླ་བ་གསུམ་དུ་མི་སྣང་བའི་ཕྱོགས་ཤིག་ན་འདུག་གོ།
en: “No one should come to see me for three months. Anyone who comes to me will be killed as punishment.” After issuing this proclamation with the ringing of bells, he did stay in a concealed location for three months.

source: །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནང་པར་སྔར་ལངས་ཏེ། རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱི་ཁྱིམ་གང་ན་བ་དེར་སོང་བ་ལས།
en: The venerable Ānanda rose at dawn and went to the residence of Agnidatta, the brahmin king.

source: ཇི་ཙམ་ན་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱི་ཞོ་ཤས་འཚོ་བ་རྣམས་སེམས་ལས་ཆུང་ངུས་འཁོད་པ་དག་མཐོང་ངོ་།
en: There he saw the laborers of Agnidatta, the brahmin king, sitting idle.

source: །མཐོང་ནས་ཀྱང་སྨྲས་པ། ཤེས་ལྡན་དག་ཅི་སེམས་ལས་ཆུང་ངུས་འཁོད་དམ།
en: When he saw this, he asked them, “Sirs, why are you sitting idle?”

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། འཕགས་པ་ཅི་ཞིག་བགྱིར་མཆིས།
en: “O noble one, what should we be doing?”

source: རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མ་བསྟབས་སམ།
en: “Has Agnidatta, the brahmin king, not offered all the requisites for three months to the community of monks headed by the Buddha?

source: ཁྱེད་ཅག་སེམས་ལས་ཆུང་ངུས་འཁོད་ནས་གདུགས་ཚོད་ཀྱང་སྟ་གོན་མི་བྱེད།
en: You are sitting idle, not preparing a meal or arranging seats.

source: གདན་ཡང་མི་ཤོམ་ན་ཅི་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གཅོད་དམ།
en: Has the meal for the community of monks headed by the Buddha been cancelled?”

source: དེ་དག་གིས་སྨྲས་པ། འཕགས་པ་ཀུན་དགའ་བོ་ལྷས་ལྔ་བརྒྱ་རྣམས་ཀྱི་ཆེད་དུ་ཞལ་ཟས་བསོད་པ་མང་དུ་སྟ་གོན་བྱོས་ཤིག་ཅེས་ནི་བཀའ་སྩལ་གྱི། ཆེ་གེ་མོ་ཞིག་གི་དོན་དུའོ་ཞེས་བཀའ་མ་སྩལ་ལགས་སོ།
en: “O noble one Ānanda,” they replied, “although His Majesty has ordered us to prepare good food abundantly for five hundred people, he has not indicated for whom it is.”

source: །ཤེས་ལྡན་དག་དེང་ལྷ་ལ་ཞུས་ཤིག །འཕགས་པ་ལྷས་དྲིལ་སྒྲོགས་སུ་སྩལ་བ།
en: “Sirs, now ask His Majesty about this.” “O noble one, His Majesty has proclaimed with the ringing of bells:

source: ང་ལ་ཟླ་བ་གསུམ་དུ་ལྟ་ཞིང་ཉེ་བར་སུ་ཡང་མ་འོང་ཤིག །གང་ཞིག་འོངས་ན་དེ་ཆད་པར་གསད་དོ་ཞེས་བསྒྲགས་ན་ཅི་བདག་ཅག་ལ་མགོ་བོ་གཉིས་མཆིས་སམ།
en: ‘No one should come to see me for three months. Anyone who comes to me will be killed as punishment.’ Do any of us have two heads?

source: བདག་ཅག་ནི་མི་ཞུ་ལགས་སོ།
en: We will not ask him.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་སྐབས་དེ་རྒྱས་པར་གསོལ་ཏོ།
en: Thereupon the venerable Ānanda went to the Blessed One. When he arrived, he reported this to the Blessed One in detail.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then issued this instruction to the venerable Ānanda:

source: ཀུན་དགའ་བོ་སོང་ལ་སྣམ་སྦྱར་ཐོགས་ཏེ་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་གཞན་ཞིག་དང་དགྲ་མཐའི་ལམ་པོ་ཆེ་དང་། ཚོང་དུས་དང་། བཞི་མདོ་དང་། སུམ་མདོ་རྣམས་སུ་ཤེས་ལྡན་དག་ཁྱེད་ཅག་ལས་གང་དག་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་དུ་ཞལ་ཟས་གསོལ་བར་སྤྲོ་བ་དེས་ཞལ་ཟས་གསོལ་ཅིག་ཅེས་སྦྲོན་ཅིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས་སྣམ་སྦྱར་ཐོགས་ཏེ་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་གཞན་ཞིག་དང་དགྲ་མཐའི་ལམ་པོ་ཆེ་དང་། ཚོང་དུས་དང་། བཞི་མདོ་དང་། སུམ་མདོ་རྣམས་སུ་བསྒོ་བ།
en: “Ānanda, go and take your outer robe. Call out, with an attending śramaṇa, in wide streets, in markets, at crossroads, and at three-forked roads in Vairambhya, ‘Sirs, whoever among you can offer meals for three months to the community of monks headed by the Buddha should do so.’ ” “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One.

source: ཤེས་ལྡན་དག་ཁྱེད་ཅག་ལས་གང་དག་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་དུ་ཞལ་ཟས་གསོལ་བར་སྤྲོ་བ་དེས་ཞལ་ཟས་གསོལ་ཅིག །དགྲ་མཐའི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་སྨྲས་པ།
en: He took his outer robe and called out, with an attending śramaṇa, in wide streets, in markets, at crossroads, and at three-forked roads in Vairambhya, “Sirs, whoever among you can offer meals for three months to the community of monks headed by the Buddha should do so.”

source: འཕགས་པ་ཀུན་དགའ་བོ་བདག་ཅག་ལྟ་ཞིག་རེ་རེས་ཀྱང་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ཟླ་བ་གསུམ་དུ་ཞལ་ཟས་གསོལ་བར་སྤྲོ་ལགས་མོད་ཀྱི། རྒྱལ་པོ་སྡིག་ཅན་འདིས་དྲིལ་སྒྲོགས་སུ་སྩལ་བ།
en: The brahmins and householders in Vairambhya said, “O noble one Ānanda, although each of us could offer meals for three months to the Blessed One together with the community of disciples, this evil king has proclaimed with the ringing of bells:

source: གཞན་སུས་ཀྱང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ཏེ་ཟླ་བ་གསུམ་དུ་ཞལ་ཟས་མ་གསོལ་ཅིག །གང་ཞིག་གིས་ཞལ་ཟས་གསོལ་ན་དེ་ནི་ཆད་པར་གསད་དོ་ཞེས་བསྒྲགས་ལགས་སོ།
en: ‘None but I should offer meals to the śramaṇa Gautama for three months. Anyone who offers a meal will be killed as punishment.’ ”

source: །ཇི་ཙམ་ན་བྱང་ཕྱོགས་ནས་དེད་དཔོན་ཞིག་རྟ་ལྔ་བརྒྱ་ལ་ཁལ་བཀལ་ཏེ་དགྲ་མཐར་ཕྱིན་ནས་དེས་བསམས་པ།
en: At that time, a caravan leader with five hundred loaded horses arrived at Vairambhya from the northern region.

source: གལ་ཏེ་མོད་ལ་ཆས་ན་རྟ་རྣམས་ཀྱི་རྨིད་པ་དུབ་པས་འཐེང་བར་འགྱུར་ཞིང་ལོམ་པར་ཡང་མི་འགྱུར་བས་འདི་ཉིད་དུ་གནས་པར་བྱའོ་སྙམ་ནས།
en: He thought, “If I depart soon, the hooves of the horses will be worn out, and they will become lame and unfit for sale. I will stay here.”

source: དེ་དེ་ཉིད་དུ་འདུག་ནས་དེས་རྟ་ཅང་ཤེས་ལ་ནི་ཆས་ནས་བྲེའུ་ཆུང་དོ། རྟ་ལྷག་མ་རྣམས་ལ་ནི་བྲེའུ་ཆུང་རེ་རེར་ཐང་བཅད་དོ།
en: He stayed there and prepared two prasthas of barley for the best horse and one prastha for each of the rest of the horses.

source: །དེས་རྒྱལ་པོས་རྩིས་མགོ་འདི་དང་འདི་དག་བྱས་སོ་ཞེས་ཐོས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དེ་སྐད་དུ་སྨྲས་པ་ཡང་ཐོས་ནས་དེས་བསམས་པ། བདག་ནི་རྒྱལ་པོ་འདིའི་ཡུལ་ན་གནས་པ་མ་ཡིན་པས་བདག་ལ་རྒྱལ་པོས་ཅི་བྱར་ཡོད་སྙམ་དུ་རིག་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་ཀུན་དགའ་བོ་བདག་གིས་རྟ་ཅང་ཤེས་ལ་ནི་ཆས་ནས་བྲེའུ་ཆུང་དོ། རྟ་ལྷག་མ་རྣམས་ལ་ནི་བྲེའུ་ཆུང་རེ་རེའི་ཐང་ལགས་ན།
en: He heard that the king had issued such-and-such a regulation, and that the venerable Ānanda had called out such-and-such, and thought, “Since I am not an inhabitant of this king’s country, the king cannot do anything against me.” He said to the venerable Ānanda, “O noble one Ānanda, I have prepared two prasthas of barley for my best horse and one prastha for each of the rest of the horses.

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་ནས་གསོལ་བར་སྤྲོ་ན། བཅོམ་ལྡན་འདས་ལ་ནི་བདག་གིས་ནས་བྲེའུ་ཆུང་དོ་དོ། དགེ་སློང་ལྷག་མ་རྣམས་ལ་ནི་བྲེའུ་ཆུང་རེ་རེ་དབུལ་བར་བགྱིའོ།
en: If the Blessed One can eat barley, I will offer two prasthas of barley for the Blessed One and one prastha for each of the rest of the monks.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་སྐབས་དེ་རྒྱས་པར་གསོལ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: Thereupon the venerable Ānanda went to the Blessed One. When he arrived, he reported this to the Blessed One in detail.

source: ང་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: The Blessed One thought, “The actions were performed and accumulated by me, accruing a heap of karma.

source: གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བའི་ལས་ང་ཉིད་ཀྱིས་བྱས་ཤིང་བསགས་པས་ང་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར་ཏེ།
en: Who else but me would experience the actions that I myself performed and accumulated?

source: ལས་བྱས་ཤིང་བསགས་པ་དག་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ཞེས་བྱ་བ་ནས།
en: Actions performed and accumulated do not mature in the element of earth, . . . which are outside the body. . . .

source: ལུས་ཅན་དག་ལ་འབྲས་བུར་འགྱུར་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “. . . They bear fruit in embodied beings.”

source: །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སོང་ལ་དགེ་སློང་རྣམས་ལ་ཚུལ་ཤིང་བྲིམས་ཏེ། ཁྱེད་ཅག་ལས་གང་དེ་བཞིན་གཤེགས་པ་དང་ཐབས་ཅིག་དགྲ་མཐར་ཟླ་བ་གསུམ་དུ་ལོངས་སྤྱད་པར་སྤྲོ་བ་དེས་ཚུལ་ཤིང་ལོང་ཤིག་ཅེས་སྒོ་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས་ཚུལ་ཤིང་བྲིམ་པར་བརྩམས་པ་ན།
en: He instructed the venerable Ānanda, “Ānanda, go and distribute counting sticks and say, ‘Whoever among you can eat barley with the Tathāgata in Vairambhya for three months should take a counting stick.’ ” “Certainly, O Honored One,” replied the venerable Ānanda, and he distributed the counting sticks.

source: གང་ཡང་བཅོམ་ལྡན་འདས་དགེ་སློང་ལྔ་བརྒྱར་དགེ་སློང་གཉིས་ཀྱིས་མ་ཚང་བས་ཚུལ་ཤིང་བླངས་སོ།
en: The Blessed One and four hundred ninety-eight monks took counting sticks.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་བསེར་མའི་བྲོ་ནད་མཆིས་པས་དགུང་ཟླ་གསུམ་དུ་སྩང་ནས་ཀྱིས་ལོངས་སྤྱད་པར་མི་སྤྲོ་ལགས་སོ།
en: “O Blessed One,” said the venerable Śāriputra, “since I have a wind illness, I cannot eat barley for three months.”

source: །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་གསོལ་པ། བདག་ནི་འདིའི་བྲོ་གཡོག་ལགས་སོ།
en: “I will take care of him,” offered the venerable Mahā­maudgalyāyana.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་ལྔ་བརྒྱར་དགེ་སློང་གཉིས་ཀྱིས་མ་ཚང་བ་དང་ཐབས་ཅིག་ཏུ་དགྲ་མཐར་དབྱར་བཞུགས་པར་ཞལ་གྱིས་བཞེས་སོ།
en: Thereupon the Blessed One entered the rainy-season retreat with the four hundred ninety-eight monks in Vairambhya.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ནི་རི་བོ་རྩེ་གསུམ་གྱི་ཁར་སོང་སྟེ་དབྱར་གནས་པར་ཁས་བླངས་སོ།
en: The venerable Śāriputra and the venerable Mahā­maudgalyāyana went to Mount Triśaṅku and there entered the rainy-season retreat.

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ལྷའི་བདུད་རྩིས་བསྟབས་སོ།
en: Śakra, Lord of the Gods, fed them with divine nectar.

source: །དེ་ནས་དེད་དཔོན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ནི་ནས་བྲེའུ་ཆུང་དོ་དོ་འབུལ་ལོ། །དགེ་སློང་གཞན་རྣམས་ལ་བྲེའུ་ཆུང་རེ་རེའོ།
en: The caravan leader offered two prasthas of barley for the Blessed One and one prastha for each of the rest of the monks.

source: ཀུན་དགའ་བོ་སོང་ལ་དེ་བཞིན་གཤེགས་པའི་ཆེད་དུ་ནས་ལ་ཅི་ལེགས་སུ་བྱོས་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་སྐལ་བླངས་ཏེ་བུད་མེད་རྒན་མོ་གཞན་ཞིག་གང་ན་ཡོད་པ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བུད་མེད་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Certainly, O Honored One,” replied the venerable Ānanda, and he took the Blessed One’s portion and went to a certain old woman.

source: །སྲིང་མོ་དེ་བཞིན་གཤེགས་པའི་ཆེད་དུ་ནས་ལ་ཅི་ལེགས་སུ་བྱ་ན་ཁྱོད་ནུས་སམ། དེས་སྨྲས་པ།
en: When he arrived, he asked the woman, “Sister, can you cook barley for the Tathāgata?”

source: འཕགས་པ་བདག་རྒན་མོས་རྔོ་མི་ཐོག་སྟེ་འོན་ཀྱང་བུ་མོ་འདི་གཞོན་ལགས་ཀྱིས་འདི་ལ་སྩོལ་ཅིག་དང་། འདིས་ནི་ཅི་ལེགས་སུ་བགྱིད་པར་འགྱུར་རོ།
en: “O noble one,” she answered, “I cannot, because I am too old. But since that girl is younger, have her do it. She will cook it.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དེའི་དྲུང་དུ་སོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ། སྲིང་མོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཆེད་དུ་ནས་ལ་ཅི་ལེགས་སུ་བྱེད་ནུས་སམ། དེས་སྨྲས་པ།
en: The venerable Ānanda then went to the younger woman and asked, “Sister, can you cook barley for the Tathāgata?”

source: འཕགས་པ་བདག་དང་དམ་ཞིག་བཅའ་སྟེ། གལ་ཏེ་བདག་ལ་ཚིག་འགའ་གསུང་བ་ལྟ་ན་ཅི་ལེགས་སུ་བགྱིའོ། །དེས་སྨྲས་པ།
en: “O noble one,” she answered, “if you promise to give me a discourse, I will.” “Make ready,” he replied. “I will do so.”
